{
    "NAVBAR": [
        {
            "NAME": "Erfahrung",
            "SECTION": "Erfahrung"
        },
        {
            "NAME": "Projekte",
            "SECTION": "Projekte"
        },
        {
            "NAME": "Über",
            "SECTION": "Über mich"
        },
        {
            "NAME": "Kontakt",
            "SECTION": "Was kommt als nächstes?"
        }
    ],
    "INTRO": {
        "ROLE": "Ein Full-Stack Entwickler",
        "ADDRESS": "Sitz in Aveiro, Portugal",
        "TECH_STACK": "Stack-Technologie"
    },
    "EXPERIENCE": [
        {
            "NAME": "Critical Manufacturing",
            "ROLE": "Programmierer",
            "DURATION": "Feb 2022 - Zurzeit",
            "ACTIVITIES": [
                "Bereitstellung von robustem Produktionscode für Projekte für Kunden wie IQE PLC und Lam Research in der Halbleiterindustrie, unter Verwendung von .NET Core C# und Angular.",
                "Softwaretests - Integration, Unit, browserbasierte und manuelle Tests - unter Verwendung von .NET Core C# und Selenium WebDriver.",
                "Behebung von Fehlern und Refactoring von Code zur Verbesserung der Nachhaltigkeit und Spaghetti-Code.",
                "Erstellung und Entwicklung von mehr als 10 Work Items mit Fokus auf Code-Verbesserungen.",
                "Zusammenarbeit in einem Multiprojekt-Entwicklungsprozess mit einem Team von fast 20 Personen, bestehend aus Entwicklern, Team- und Projektmanagern, funktionalen Analysten, technischen Leitern und Lösungsarchitekten.",
                "Unterstützung von mehr als 2 neuen Teammitgliedern in der Onboarding-Phase bei der Einrichtung ihrer lokalen Umgebung und Hilfe im Entwicklungsprozess.",
                "Zusammenarbeit mit dem Lösungsarchitekten und den technischen Leitern bei der Erstellung des technischen Designansatzes der User Stories."
            ]
        },
        {
            "NAME": "Mafirol Group",
            "ROLE": "Full-Stack Entwickler",
            "DURATION": "Mar 2021 - Jan 2022",
            "ACTIVITIES": [
                "Wartung und Verbesserung von internen .NET Framework C# Webanwendungen.",
                "Wartung der externen Webanwendung, die in .NET Core C#, Vue.js und MySQL entwickelt wurde.",
                "Erneuerung der Unternehmenswebseite durch Erstellung einer Webanwendung mit .NET Core C# und React Framework.",
                "Datenbankmodellierung und -implementierung in SQL Server.",
                "Entwicklung von RESTFul API, um Informationen in der Datenbank zu senden und zu speichern.",
                "Implementierung des Übersetzungsmanagement-Frameworks (i18next) in die Webanwendung."
            ]
        },
        {
            "NAME": "Wavecom",
            "ROLE": "Backend Entwickler",
            "DURATION": "Mar 2020 - Jul 2020",
            "ACTIVITIES": [
                "Python-Kurs zur Entwicklung von Webanwendungen mit dem Flask-Framework.",
                "Studium der Python-Bibliotheken unittest, pytest und Mock.",
                "Studium der Arbeitsabläufe und Methoden von Git.",
                "Analyse der Struktur einer Flask-Anwendung in der Produktion (Microservice).",
                "Implementierung von Unit-Tests in Python.",
                "Lokalisierungsalgorithmus in Python, der die Position eines Tags entsprechend dem eingehenden Signal durch verschiedene Gateways berechnet."
            ]
        }
    ],
    "PROJECTS": [
        {
            "NAME": "Mafirol",
            "DESCRIPTION": "Eine reaktionsfähige Webanwendung mit Internationalisierung, die ich im Rahmen einer meiner beruflichen Tätigkeiten entwickelt habe. <u>Die Anwendung kann sich ändern oder ausgefallen sein.</u>"
        },
        {
            "NAME": "Persönliche Website",
            "DESCRIPTION": "Eine responsive Webseite mit Internationalisierung und Dark/Light Mode."
        }
    ],
    "ABOUT": {
        "DESCRIPTION": "Ich kann sagen, dass ich 2017 ohne klare Richtung in die Programmierung eingestiegen bin, aber ich habe schnell einen Geschmack für die Möglichkeiten bekommen, die sie bietet.\n\nIch bin ein dynamischer Entwickler aus Portugal, der gerne Dinge entwickelt, die für den Endnutzer einen Mehrwert darstellen. Wann immer ich an etwas arbeite, ist es mein Ziel, mein Wissen und meine Erfahrung einzubringen, Neues zu lernen und auf Nachhaltigkeit und Wartbarkeit zu achten.\n\nZurzeit arbeite ich als Software-Ingenieur bei Critical Manufacturing, wo ich kundenspezifische und maßgeschneiderte Produkte entwickle.",
        "ROLE": {
            "TITLE": "Rolle",
            "DESCRIPTION": "Full-Stack Entwickler"
        },
        "EMPLOYMENT": {
            "TITLE": "Beschäftigung",
            "DESCRIPTION": "Erwerbstätig"
        }
    },
    "CONTACT": {
        "SUBTITLE": "Rufen Sie mich an!",
        "DESCRIPTION": "Falls Sie Fragen, Kommentare oder Vorschläge haben, werde ich mein Bestes tun, um Ihnen zu antworten!",
        "BUTTON": "Hallo sagen"
    },
    "FOOTER": {
        "DISCLAIMER": "Entworfen und gebaut von Ricardo Balreira"
    },
    "NOTFOUND": {
        "ERROR": "Fehler",
        "MESSAGE": "Du unterschätzt die Macht des dunklen Atoms",
        "BUTTON": "Zurücktreten"
    }
}