{
    "NAVBAR": [
        {
            "NAME": "Experience",
            "SECTION": "Experience"
        },
        {
            "NAME": "Projects",
            "SECTION": "Projects"
        },
        {
            "NAME": "About",
            "SECTION": "About me"
        },
        {
            "NAME": "Contact",
            "SECTION": "What's next?"
        }
    ],
    "INTRO": {
        "ROLE": "A Full-Stack Developer",
        "ADDRESS": "Based in Aveiro, Portugal",
        "TECH_STACK": "Tech Stack"
    },
    "EXPERIENCE": [
        {
            "NAME": "Critical Manufacturing",
            "ROLE": "Software Engineer",
            "DURATION": "Feb 2022 - Present",
            "ACTIVITIES": [
                "Deliver robust production code of projects for clients including IQE PLC and Lam Research on Semiconductor Industry, using .NET Core C# and Angular.",
                "Software testing – integration, unit, browser-based and manual tests – using .NET Core C# and Selenium WebDriver.",
                "Fixing bugs and refactoring code to improve sustainability and spaghetti code.",
                "Created and developed more than 10 Work Items focused on code improvements.",
                "Collaborate in a multi-project development process with a team of almost 20 people composed by developers, team and project manager, functional analysts, technical leaders and solution architect.",
                "Supported more than 2 new teammates in their onboarding phase setting up their local environment and helping them out in development process.",
                "Collaborate with solution architect and technical leaders on doing the technical design approach of User Stories."
            ]
        },
        {
            "NAME": "Mafirol Group",
            "ROLE": "Full Stack Developer",
            "DURATION": "Mar 2021 - Jan 2022",
            "ACTIVITIES": [
                "Maintenance and enhancement of internal .NET Framework C# Web applications.",
                "Maintenance of external Web application developed in .NET Core C#, Vue.js and MySQL",
                "Renewal of the company website creating Web application using .NET Core C# and React framework",
                "Database modeling and implementation in SQL Server",
                "Development of RESTFul API in order to send and store information in Database",
                "Implementation of translation management framework (i18next) in web application"
            ]
        },
        {
            "NAME": "Wavecom",
            "ROLE": "Backend Developer",
            "DURATION": "Mar 2020 - Jul 2020",
            "ACTIVITIES": [
                "Python course on web application development using Flask framework",
                "Study of Python's unittest, pytest and Mock libraries",
                "Study of Git's workflow and methodologies",
                "Analysis of the structure of a Flask application in production (microservice)",
                "Implementation of unit tests in Python",
                "Localization algorithm in Python that calculates the position of a tag accordingly to the incoming signal by different gateway"
            ]
        }
    ],
    "PROJECTS": [
        {
            "NAME": "Mafirol",
            "DESCRIPTION": "A responsive Web application with internationalization built in one of my job experiences. <u>The application may change or be down.</u>"
        },
        {
            "NAME": "Personal Website",
            "DESCRIPTION": "A responsive website single page with internationalization and Dark/Light Mode."
        }
    ],
    "ABOUT": {
        "DESCRIPTION": "I can say that I started out in the programming field in 2017 with no clear direction, but I quickly got a taste for the possibilities it offers.\n\nI am a dynamic developer from Portugal that likes to build things that can add value to the end user. Whenever I am working on something, my goal is to bring my knowledge and experience to the table, learning new stuff and looking for sustainability and maintainability.\n\nMy focus these days is working as a Software Engineer at Critical Manufacturing, building specific-designed and custom products to clients.",
        "ROLE": {
            "TITLE": "Role",
            "DESCRIPTION": "Full-Stack Developer"
        },
        "EMPLOYMENT": {
            "TITLE": "Employment",
            "DESCRIPTION": "Employed"
        }
    },
    "CONTACT": {
        "SUBTITLE": "Hit me up!",
        "DESCRIPTION": "In case you have a question, comments or suggestions, I'll try my best to get back to you!",
        "BUTTON": "Say Hello"
    },
    "FOOTER": {
        "DISCLAIMER": "Designed & Built by Ricardo Balreira"
    },
    "NOTFOUND": {
        "ERROR": "Error",
        "MESSAGE": "You underestimate the power of the dark atom",
        "BUTTON": "Go Back"
    }
}