{
    "NAVBAR": [
        {
            "NAME": "Experiência",
            "SECTION": "Experiência"
        },
        {
            "NAME": "Projetos",
            "SECTION": "Projetos"
        },
        {
            "NAME": "Sobre",
            "SECTION": "Sobre mim"
        },
        {
            "NAME": "Contacto",
            "SECTION": "E agora?"
        }
    ],
    "INTRO": {
        "ROLE": "Um Full-Stack Developer",
        "ADDRESS": "Situado em Aveiro, Portugal",
        "TECH_STACK": "Tecnologias"
    },
    "EXPERIENCE": [
        {
            "NAME": "Critical Manufacturing",
            "ROLE": "Engenheiro de Software",
            "DURATION": "Fev 2022 - Atualmente",
            "ACTIVITIES": [
                "Entrega de código robusto para produção em projetos para clientes, tais como IQE PLC e Lam Research na Industria de Semicondutores, usando .NET Core C# e Angular.",
                "Teste de software – integração, unitários e browser-based – usando .NET Core C# e Selenium WebDriver.",
                "Resolução de bugs e refatoração de código para melhorar sustentabilidade e spaghetti code.",
                "Criação e implementação de mais de 10 Work Items focados na melhoria de código.",
                "Colaboração num processo de desenvolvimento multi-projeto com uma equipa de quase 20 pessoas constituída por programadores, gestor de equipa e de projeto, analistas funcionais, líderes técnicos e arquitetos de solução.",
                "Suporte a mais de 2 colegas de equipa no seu processo onboarding a configurar o ambiente local e a ajudar no desenvolvimento de código.",
                "Colaboração com o arquiteto de solução e líderes técnicos a conceber o design técnico de User Stories."
            ]
        },
        {
            "NAME": "Mafirol Group",
            "ROLE": "Full-Stack Developer",
            "DURATION": "Mar 2021 - Jan 2022",
            "ACTIVITIES": [
                "Manutenção e melhoria de aplicações Web internas desenvolvidas em .NET Framework C#.",
                "Manutenção de aplicação Web externa desenvolvida em .NET Core C#, Vue.js e MySQL.",
                "Renovação do website da empresa criando aplicação Web em .NET Core C# e framework React.",
                "Implementação e modelação de Base de Dados em SQL Server.",
                "Desenvolvimento de API RESTFul de forma a enviar e guardar informações em Base de Dados.",
                "Implementação de framework de gestão de traduções (i18next) em aplicação Web."
            ]
        },
        {
            "NAME": "Wavecom",
            "ROLE": "Backend Developer",
            "DURATION": "Mar 2020 - Jul 2020",
            "ACTIVITIES": [
                "Curso de Python na vertente do desenvolvimento de aplicações web utilizando a framework Flask.",
                "Estudo das bibliotecas unittest, pytest e Mock do Python.",
                "Estudo do fluxo e metodologias Git.",
                "Análise da estrutura de uma aplicação Flask em produção (micro-serviço).",
                "Implementação de testes unitários em Python",
                "Algoritmo de localização em Python que calcule a posição de uma tag em função do sinal recebido por diferentes gateways."
            ]
        }
    ],
    "PROJECTS": [
        {
            "NAME": "Mafirol",
            "DESCRIPTION": "Uma aplicação Web responsiva com internacionalização desenvolvida numa das minhas experiências profissionais. <u>Poderá ocorrer uma mudança na aplicação ou esta ficar em baixo.</u>"
        },
        {
            "NAME": "Website Pessoal",
            "DESCRIPTION": "Um website single page responsivo com internacionalização e temas de cores escuro/claro."
        }
    ],
    "ABOUT": {
        "DESCRIPTION": "Posso dizer que enveredei na área da programação em 2017 sem rumo definido, mas rapidamente ganhei gosto pelas possibilidades que proporciona.\n\nSou um developer dinâmico de Portugal que gosta de desenvolver coisas que consigam acrescentar valor para o utilizador final. Sempre que estou a trabalhar em algo, meu objetivo é colocar em prática o conhecimento e experiência adquirido, aprender e procurar sustentabilidade e manutenção.\n\nAtualmente, sou Engenheiro de Software na Critical Manufacturing, em que colaboro no desenvolvimento de produtos específicos e personalizados para clientes.",
        "ROLE": {
            "TITLE": "Função",
            "DESCRIPTION": "Full-Stack Developer"
        },
        "EMPLOYMENT": {
            "TITLE": "Situação",
            "DESCRIPTION": "Empregado"
        }
    },
    "CONTACT": {
        "SUBTITLE": "Dá-me um toque!",
        "DESCRIPTION": "Se surgir alguma questão, comentários ou sugestões, farei o possível para responder de volta!",
        "BUTTON": "Diz olá"
    },
    "FOOTER": {
        "DISCLAIMER": "Desenhado e desenvolvido por Ricardo Balreira"
    },
    "NOTFOUND": {
        "ERROR": "Erro",
        "MESSAGE": "Subestimaste o poder do átomo das trevas",
        "BUTTON": "Voltar"
    }
}